// ห้องสมุดท้องถิ่นได้สร้างระบบเพื่อจัดหมวดหมู่หนังสือตาม รหัสหนังสือ 
// โดยคุณได้รับมอบหมายให้เขียนโปรแกรมเพื่อตรวจสอบว่า หนังสือ 
// ควรจะถูกจัดไว้ที่ส่วนใดของห้องสมุด โดยพิจารณาจาก รหัสหนังสือ 
// และตัวเลขสองหลักสุดท้ายของรหัส

// ถ้ารหัสหนังสือน้อยกว่า 1000:

// ถ้าตัวเลขหลักสุดท้ายเป็น 0 หรือ 5 หนังสือจะถูกจัดในหมวด "Science"
// ถ้าตัวเลขหลักสุดท้ายเป็น 3 หรือ 7 หนังสือจะถูกจัดในหมวด "Literature"
// หากเป็นตัวเลขอื่น ๆ ให้จัดในหมวด "General Collection"
// ถ้ารหัสหนังสือมีค่า 1000 หรือมากกว่า:

// ถ้าตัวเลขสองหลักสุดท้ายหารด้วย 4 ลงตัว หนังสือจะถูกจัดในหมวด "Reference"
// ถ้าตัวเลขสองหลักสุดท้ายคือ 11, 22 หรือ 33 หนังสือจะถูกจัดในหมวด "History"
// สำหรับกรณีอื่น ๆ ให้จัดอยู่ในหมวด "Unclassified"
// เขียนโปรแกรมภาษา C เพื่ออ่านค่า รหัสหนังสือ (book_id) 
// และแสดงผลหมวดหมู่ที่หนังสือควรจะถูกจัดให้อยู่

// Hint: ทำเสร็จให้ลองไปดูโค้ดเพื่อนที่ผ่านแล้วและใข้คนละวิธีกับเรา

#include <stdio.h>

int main() {
    int book_id, last, second_last;
    scanf("%d", &book_id);

    last = book_id % 10;
    second_last = book_id % 100;

    if (book_id < 1000) {
        if (last == 0 || last == 5) {
            printf("Science");
        } else if (last == 3 || last == 7) {
            printf("Literature");
        } else {
            printf("General Collection");
        }
    } else if (book_id >= 1000) {
        if (second_last % 4 == 0) {
            printf("Reference");
        } else if (second_last == 11 || second_last == 22 || second_last == 33) {
            printf("History");
        } else {
            printf("Unclassified");
        }
    }
}