// กระดาษมีหลายขนาด

// กระดาษที่มีขนาดใหญ่ที่สุดคือ A0 มีขนาดเท่ากับกระดาษขนาด A1 จำนวน 2 แผ่น
// กระดาษขนาด A1 จำนวน 1 แผ่น มีขนาดเท่ากับกระดาษขนาด A2 จำนวน 2 แผ่น
// กระดาษขนาด A2 จำนวน 1 แผ่น มีขนาดเท่ากับกระดาษขนาด A3 จำนวน 2 แผ่น
// ...
// ...
// ไปเรื่อยๆ จนถึงกระดาษที่มีขนาดเล็กที่สุดในรูป คือ A10

// หากกำหนดขนาดกระดาษมา 2 ขนาด คือ ขนาด X กับ Y โดย X มีขนาดกระดาษใหญ่กว่า
// หรือเท่ากับ Y เสมอ จงหาว่า ต้องใช้กระดาษ Y กี่แผ่น 
// จึงจะมีขนาดเท่ากับกระดาษขนาด X 1 แผ่น

#include <stdio.h>
#include <math.h>

int main() {
    int x, y;
    scanf("A%d\nA%d", &x, &y);
    printf("%d\n", (int)pow(2, (y - x)));

    return 0;
}
